#! /usr/bin/env bash

tap 'homebrew/bundle'

# Core / Build
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'bat'
brew 'bash' # Bash 4
brew 'zsh'
brew 'zsh-completions'

# Languages
brew 'rbenv'
brew 'php'
brew 'node'
brew 'yarn'
brew 'composer'

# Language Helpers
brew 'ctags'

# Editor
brew 'neovim'

# Network tools
brew 'curl'
brew 'wget'
brew 'dnsmasq'
brew 'nmap'
brew 'dnsmasq'

# Overrides
brew 'git'
brew 'git-lfs'
brew 'openssh'
brew 'grep'

# Other
brew 'awscli'
brew 'ledger'
brew 'figlet'
brew 'cowsay'

# CHECK BELOW

# brew 'gnupg2'
brew 'mas'
# brew 'trash'
brew 'tree'
