
tap 'homebrew/bundle'

# {{{ HomeBrew

# Core / Build
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'bat'
brew 'bash' # Bash 4
brew 'zsh'
brew 'zsh-completions'

# Languages
brew 'rbenv'
brew 'php'
brew 'Schniz/tap/fnm'
brew 'composer'

# Language Helpers
brew 'ctags'

# Editor
brew 'neovim'

# Network tools
brew 'curl'
brew 'wget'
brew 'dnsmasq'
brew 'nmap'
brew 'httpie'

# Overrides
brew 'git'
brew 'git-lfs'
brew 'git-flow'
brew 'openssh'
brew 'grep'
brew 'ripgrep'

# Other
brew 'thefuck'
brew 'awscli'
brew 'ledger'
brew 'figlet'
brew 'cowsay'
brew 'archey'
brew 'htop'
brew 'nmap'
brew 'geoip'
brew 'watch'
brew 'wifi-password'
brew 'terminal-notifier'
brew 'terraform'
brew 'packer'
brew 'watch'
brew 'hub'

brew 'links'
brew 'lynx'
brew 'irssi'
brew 'midnight-commander'

# CHECK BELOW

brew 'mas'
brew 'tree'

# }}}

# {{{ Cask

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Fonts
cask 'font-mononoki'

# Applications
cask 'dash2'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'gpg-suite'
cask 'iterm2'
cask 'kaleidoscope'
cask 'keka'
cask 'macdown'
cask 'mysqlworkbench'
cask 'opera'
cask 'phpstorm'
cask 'sequel-pro'
cask 'sqlpro-for-postgres'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text3'
cask 'transmit'
cask 'transmission'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

# cask 'aerial'
# cask 'caffeine'
# cask 'discord'
# cask 'dropbox'
# cask 'eid-be'
# cask 'eid-be-viewer'
# cask 'gpg-suite'
# cask 'insomnia'
# cask 'tableplus'
# cask 'there'
# cask 'tor-browser'
# cask 'glimmerblocker'
# cask 'hammerspoon'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'quicklookase'
cask 'qlImageSize'

# }}}

# {{{ Mac App Store

mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694

mas 'DaisyDisk', id: 411643860
mas '1Password', id: 1333542190
mas 'Magnet', id: 441258766
# mas 'Moom', id: 419330170

mas 'Airmail 3', id: 918858936
mas 'Spark', id: 1176895641
mas '2Do', id: 477670270
mas 'iA Writer', id: 775737590
mas 'Bear', id: 1091189122
mas 'Create Booklet', id: 943029046
mas 'XMind', id: 1327661892
mas 'WhatsApp', id: 1147396723
mas 'Giphy Capture', id: 668208984
mas 'The Unarchiver', id: 425424353

# }}}

