
# {{{ HomeBrew

tap 'homebrew/bundle'

# Core / Build
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'bat'
brew 'bash' # Bash 4
brew 'zsh'
brew 'zsh-completions'

# Languages
brew 'rbenv'
brew 'php'
brew 'node'
brew 'yarn'
brew 'composer'

# Language Helpers
brew 'ctags'

# Editor
brew 'neovim'

# Network tools
brew 'curl'
brew 'wget'
brew 'dnsmasq'
brew 'nmap'

# Overrides
brew 'git'
brew 'git-lfs'
brew 'openssh'
brew 'grep'

# Other
brew 'awscli'
brew 'ledger'
brew 'figlet'
brew 'cowsay'

# CHECK BELOW

brew 'mas'
brew 'tree'

# }}}

# {{{ Cask

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Fonts
cask 'font-mononoki'

# Applications
cask 'dash2'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'kaleidoscope'
cask 'keka'
cask 'macdown'
cask 'macdown'
cask 'mysqlworkbench'
cask 'opera'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text3'
cask 'transmit'
cask 'transmission'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

# cask 'aerial'
# cask 'caffeine'
# cask 'discord'
# cask 'dropbox'
# cask 'eid-be'
# cask 'eid-be-viewer'
# cask 'gpg-suite'
# cask 'insomnia'
# cask 'tableplus'
# cask 'there'
# cask 'tor-browser'
# cask 'glimmerblocker'
# cask 'hammerspoon'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'

# }}}

# {{{ Mac App Store

# Mac App Store
# mas '1Password', id: 1333542190
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Sip', id: 507257563
# mas 'Spark', id: 1176895641
# mas 'The Unarchiver', id: 425424353
# mas 'Unsplash', id: 1284863847
# mas 'WhatsApp', id: 1147396723

# }}}

